combustion/reactingFoam/LES/DLRJHC/case/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 4.1);

boundaryField
{
    fuel_inlet
    {
        type            fixedValue;
        value           uniform (0 0 163.18);
    }
    air_inlet
    {
        type            fixedValue;
        value           uniform (0 0 4.1);
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }
    walls
    {
        type            noSlip;
    }
    sides
    {
        type            symmetry;
    }
}


// ************************************************************************* //
