combustion/reactingFoam/LES/DLRJHC/case/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

cp -r 0.orig 0

# Meshing
runApplication blockMesh

# Decomposing
runApplication decomposePar

# Simulating
runParallel $(getApplication)

# Validating
./validation/Allvalidate

#------------------------------------------------------------------------------
