combustion/reactingFoam/LES/DLRJHC/case/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          chemistryProperties;
}

chemistryType
{
    solver          ode;
    method          TDAC;
}

importantSpecies
{
    CH4             ;
    H2O             ;
    O2              ;
    CO2             ;
}

chemistry       yes;

initialChemicalTimeStep 1e-07;

odeCoeffs
{
    solver          Rosenbrock34;
    absTol          1e-12;
    relTol          1e-07;
}

reduction
{
    active          on;
    log             on;
    tolerance       0.0001;
    method          DAC;
    initialSet
    {
        CH4             ;
        H2O             ;
        O2              ;
    }
    automaticSIS    no;
    fuelSpecies
    {
        CH4             1;
    }
}

tabulation
{
    active          on;
    log             on;
    printProportion off;
    printNumRetrieve off;
    tolerance       0.0001;
    method          ISAT;
    scaleFactor
    {
        otherSpecies    1;
        Temperature     1000;
        Pressure        101325;
        deltaT          0.5;
    }
    maxNLeafs       2000;
    chPMaxLifeTime  100;
    maxGrowth       10;
    checkEntireTreeInterval 5;
    maxDepthFactor  2;
    minBalanceThreshold 30;
    MRURetrieve     false;
    maxMRUSize      0;
    growPoints      true;
    maxNumNewDim    10;
    variableTimeStep true;
}


// ************************************************************************* //
